Appiko/stm32h7x/F7_discovery_cam_trial/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "adc.h"
#include "crc.h"
#include "dcmi.h"
#include "dma.h"
#include "fatfs.h"
#include "i2c.h"
#include "ltdc.h"
#include "rtc.h"
#include "sdmmc.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "usb_host.h"
#include "gpio.h"
#include "fmc.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stdbool.h"
#include "stm32746g_discovery.h"
#include "stm32746g_discovery_sdram.h"
#include "rk043fn48h.h"
#include "fonts.h"

#ifdef OV9655
#include "ov9655.h"
#endif
#ifdef AR0135
#include "ar0135.h"
#endif
#ifdef IMX290
#include "imx290.h"
#endif
//#include "font24.c"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define PIX_H 1080
#define PIX_W 1920


#define FILE_OPER_MAX_TRY 3

#define FLASH_TICKS 600

#define SHOT_TICKS 1250


typedef struct 
{
    uint8_t b;
    uint8_t g;
    uint8_t r;
}RGB_data_t;

uint8_t ppm_header[] = {'P','6','\n','1','2','8','0',' ','9','6','0','\n','2','5','5','\n'};

uint8_t CAMERA_Init(uint32_t );
static void LTDC_Init(uint32_t, uint16_t, uint16_t, uint16_t, uint16_t);
void LCD_GPIO_Init(LTDC_HandleTypeDef *, void *);
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
extern RGB_data_t _fb_base_rgb[270][320];
extern uint8_t _fb_base_hr[PIX_H ][PIX_W];
FIL fp;

typedef enum
{
CAMERA_OK = 0x00,
CAMERA_ERROR = 0x01,
CAMERA_TIMEOUT = 0x02,
CAMERA_NOT_DETECTED = 0x03,
CAMERA_NOT_SUPPORTED = 0x04
} Camera_StatusTypeDef;
typedef struct
{
uint32_t TextColor;
uint32_t BackColor;
sFONT *pFont;
}LCD_DrawPropTypeDef;
typedef struct
{
int16_t X;
int16_t Y;
}Point, * pPoint;
static LCD_DrawPropTypeDef DrawProp[2];
LTDC_HandleTypeDef hltdc;
LTDC_LayerCfgTypeDef
layer_cfg;
static RCC_PeriphCLKInitTypeDef periph_clk_init_struct;
CAMERA_DrvTypeDef *camera_driv;
/* Camera module I2C HW address */
static uint32_t CameraHwAddress;
/* Image size */
uint32_t Im_size = 0;

/* Expo us */
static uint32_t g_expo_us;

static uint32_t g_file_no;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void MX_USB_HOST_Process(void);

/* USER CODE BEGIN PFP */
uint8_t img_bayer2rgb (uint32_t index);
uint8_t img_compress_16 (uint32_t index);
uint8_t img_compress_rgb (void);
uint8_t lcd_bayer2rgb (uint32_t index);
uint8_t img_file_append (uint8_t * p_data, uint32_t len);


void cam_init (uint32_t resolution);

void cam_shot_start (uint32_t not_used);

void cam_shot_stop (uint32_t not_used);

void cam_flash_start (uint32_t not_used);

void cam_flash_stop (uint32_t not_used);

void cam_save (uint32_t file_no);

void cam_light_check (uint32_t light_val);

void get_file_no ();


void ( * cam_func[CAM_INVALID]) (uint32_t) = {cam_init, cam_shot_start, cam_shot_stop, 
cam_flash_start, cam_flash_stop, cam_save, cam_light_check};

void sd_init (void);

void trig_init ();


volatile cam_state_t cam_state = CAM_INVALID;

volatile uint32_t cam_param = 0;

//temp

volatile uint8_t cam_state_change = 0;
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */
  

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC3_Init();
  MX_CRC_Init();
  MX_DCMI_Init();
  MX_FMC_Init();
//  MX_I2C1_Init();
  MX_I2C3_Init();
//  MX_LTDC_Init();
  MX_RTC_Init();
  MX_SDMMC1_SD_Init();
  MX_SPI2_Init();
  MX_TIM3_Init();
  MX_TIM5_Init();
  MX_TIM8_Init();
  MX_TIM12_Init();
  MX_USART1_UART_Init();
  MX_USART6_UART_Init();
  MX_USB_HOST_Init();
  MX_FATFS_Init();
  MX_TIM1_Init();
  /* USER CODE BEGIN 2 */
  HAL_UART_MspInit (&huart1);
//  HAL_DCMI_MspInit (&hdcmi);
//  HAL_I2C_MspInit (&hi2c1);
  printf("Hello world\n");
  printf("Macro : 0x%x, LCD : 0x%x, HR : 0x%x\n",FRAME_BUFFER, _fb_base_rgb, _fb_base_hr);
//  uint8_t i2c_addr = 00;
//  i2c_addr = cambus_scan ();  
//  printf("First I2C device found : 0x%x\n",i2c_addr);

  
