Appiko/stm32h7x/F7_discovery_cam_trial/Src/main.c
  LTDC_Init((uint32_t)_fb_base_rgb, 80, 1, 400, 270);
  BSP_SDRAM_Init();
  sd_init();
  get_file_no ();
  trig_init ();
  HAL_ADC_Start (&hadc3);
  HAL_ADC_GetValue (&hadc3);
  
  CAMERA_IO_Init();
  
  printf("RTC state : %d\n", hrtc.State);

  Im_size = (PIX_H*PIX_W)/4;
  memset (_fb_base_hr, 0, Im_size*4);
  memset (_fb_base_rgb, 0, 320*240);
  CAMERA_Init(CAMERA_RAW);
  HAL_Delay(100);
//  cam_state = CAM_INIT;
//  cam_param = 0;
//  g_expo_us = 750;
//  cam_state_change = true;
  HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, (uint32_t)_fb_base_hr, Im_size);
  
//  while(HAL_DCMI_STATE_READY != hdcmi.State);
  
  HAL_Delay (1500);
  
  img_compress_rgb ();
  
  
  printf("HR : \n");
  for(uint32_t r = 0; r < 10; r++)
  {
      for(uint32_t w = 0; w < 10; w++)
      {
          printf("%d ", _fb_base_hr[r][w]);
      }
      printf("\n");
  }
    printf("DCMI : state %d, Error %d\n",hdcmi.State, hdcmi.ErrorCode);
    printf("DMA : state %d, Error %d\n",hdcmi.DMA_Handle->State, hdcmi.DMA_Handle->ErrorCode);
  
  
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */
    MX_USB_HOST_Process();

    /* USER CODE BEGIN 3 */
      
      if(cam_state_change)
      {
        cam_state_change = false;
        cam_func[cam_state] (cam_param);
      }
      __WFI();
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

  /** Configure LSE Drive Capability 
  */
  HAL_PWR_EnableBkUpAccess();
  __HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_LOW);
  /** Configure the main internal regulator output voltage 
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  /** Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE|RCC_OSCILLATORTYPE_LSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 432;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Activate the Over-Drive mode 
  */
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_7) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LTDC|RCC_PERIPHCLK_RTC
                              |RCC_PERIPHCLK_USART1|RCC_PERIPHCLK_USART6
                              |RCC_PERIPHCLK_I2C1|RCC_PERIPHCLK_I2C3
                              |RCC_PERIPHCLK_SDMMC1|RCC_PERIPHCLK_CLK48;
  PeriphClkInitStruct.PLLSAI.PLLSAIN = 384;
  PeriphClkInitStruct.PLLSAI.PLLSAIR = 5;
  PeriphClkInitStruct.PLLSAI.PLLSAIQ = 2;
  PeriphClkInitStruct.PLLSAI.PLLSAIP = RCC_PLLSAIP_DIV8;
  PeriphClkInitStruct.PLLSAIDivQ = 1;
  PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_8;
  PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
  PeriphClkInitStruct.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
  PeriphClkInitStruct.Usart6ClockSelection = RCC_USART6CLKSOURCE_PCLK2;
  PeriphClkInitStruct.I2c1ClockSelection = RCC_I2C1CLKSOURCE_PCLK1;
  PeriphClkInitStruct.I2c3ClockSelection = RCC_I2C3CLKSOURCE_PCLK1;
  PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48SOURCE_PLL;
  PeriphClkInitStruct.Sdmmc1ClockSelection = RCC_SDMMC1CLKSOURCE_CLK48;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_PLLCLK, RCC_MCODIV_1);
}

/* USER CODE BEGIN 4 */
void HAL_RTCEx_WakeUpTimerEventCallback (RTC_HandleTypeDef* hrtc)
{
//    printf("%s\n", __func__);
    cam_state = CAM_LIGHT_CHECK;
    cam_param = 0;
    cam_state_change= true;
}

void HAL_DCMI_VsyncEventCallback (DCMI_HandleTypeDef* dcmiHandle)
{
//    HAL_GPIO_TogglePin (ARDUINO_D4_GPIO_Port, ARDUINO_D4_Pin);
//    __HAL_DCMI_DISABLE_IT(&hdcmi, DCMI_IT_VSYNC);
//    cam_state = CAM_SAVE;
//    cam_state_change = 1;
//    cam_param = ++g_file_no;
////    dcmi_done ();
//    printf("%s\n", __func__);
}

void HAL_DCMI_LineEventCallback (DCMI_HandleTypeDef* hdcmi)
{
//    HAL_GPIO_TogglePin (ARDUINO_D2_GPIO_Port, ARDUINO_D2_Pin);
}
/*
void HAL_TIM_PWM_PulseFinishedCallback (TIM_HandleTypeDef* htim)
{
    if(htim->Instance == TIM1)
    {
        switch(htim->Channel)
        {
            case HAL_TIM_ACTIVE_CHANNEL_1 :
                cam_state = CAM_SHOT_END;
                cam_state_change = true;
                break;
            case HAL_TIM_ACTIVE_CHANNEL_2 :
                cam_state = CAM_FLASH_END;
                cam_state_change = true;
                break;
                
        }
    }
}

void HAL_GPIO_EXTI_Callback (uint16_t GPIO_Pin)
{
    switch(GPIO_Pin)
    {
        case ARDUINO_A3_Pin : 
            printf("Sense Trigger\n");
        case USER_BUTTON_Pin : 
            {
                cam_state = CAM_SHOT_START;
                cam_state_change = true;
                cam_param = 0;
                break;
            }
        case ARDUINO_A1_Pin : 
            {
                cam_state = CAM_FLASH_START;
                cam_state_change = true;
                cam_param = 95;
                break;
            }
    }
}
*/
void trig_init ()
{
    static GPIO_InitTypeDef GPIO_InitStruct = {0};

    __disable_irq() ;

    HAL_GPIO_DeInit(ARDUINO_A3_GPIO_Port, ARDUINO_A3_Pin);
    HAL_GPIO_DeInit(USER_BUTTON_GPIO_Port, USER_BUTTON_Pin);
    HAL_GPIO_DeInit(ARDUINO_A1_GPIO_Port, ARDUINO_A1_Pin);
  
    /*Configure GPIO pin : PtPin */
    __HAL_GPIO_EXTI_CLEAR_IT( ARDUINO_A1_Pin);
    
    GPIO_InitStruct.Pin = ARDUINO_A1_Pin; //Flash
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    HAL_GPIO_Init(ARDUINO_A1_GPIO_Port, &GPIO_InitStruct);

