Appiko/stm32h7x/F7_discovery_cam_trial/Src/main.c
    GPIO_InitStruct.Pin = USER_BUTTON_Pin; //User button
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(USER_BUTTON_GPIO_Port, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = ARDUINO_A3_Pin; // SenseDev
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(ARDUINO_A3_GPIO_Port, &GPIO_InitStruct);

    
    __enable_irq() ;

//    CAMERA_Init(CAMERA_RAW);

}

void sd_init (void)
{
    uint32_t status;
  if(BSP_SD_IsDetected ())
  {
      printf("SD Card detected\n");
      status = SD_initialize (0);
      if(status  == RES_OK)
      {
          printf("SD Card ready\n");
          HAL_Delay (100);
          status = f_mount (&SDFatFS, (const TCHAR*)SDPath, 1);
          if(status == FR_OK)
          {
              printf("Mount successful\n");
    
          }
          else {printf("Mount Failed : %d\n", status);}
      }
      else {printf("SD Card not ready : %d\n", hsd1.State);}
  }
  else{printf("SD Card not present\n");}
}

void write_sd_card (uint32_t file_no)
{
//    while(hdcmi.State != HAL_DCMI_STATE_READY);
    static attempts_remain = FILE_OPER_MAX_TRY;
    uint32_t status = 0;
    uint8_t file_name[] = {'x','x','x','x','.','r','g','b', '\0'};
    
    file_name[0] = (file_no/1000) + 0x30;
    file_name[1] = ((file_no%1000)/100) + 0x30;
    file_name[2] = ((file_no%100)/10) + 0x30;
    file_name[3] = (file_no%10) + 0x30;
    
    printf("Attempt : %d\n", FILE_OPER_MAX_TRY - attempts_remain + 1);
    printf ("upcoming file name : %x %x %x %x\n", file_name[0],file_name[1],file_name[2],file_name[3]);
    if(attempts_remain > 0)
    {
        status = f_open (&fp, (char *)file_name, FA_CREATE_ALWAYS | FA_WRITE);
    //    status = f_open (&fp, "0020.rgb", FA_CREATE_ALWAYS | FA_WRITE);
        if(status == FR_OK)
        {
            uint8_t byteswritten;
            printf("File open\n");
            status = f_write (&fp,(void *)_fb_base_hr, sizeof(_fb_base_hr), &byteswritten);
            if(status == FR_OK)
            {
                status = f_close (&fp);
                if(status == FR_OK)
                {
                    printf("Safe to remove SD Card\n");
                    attempts_remain = FILE_OPER_MAX_TRY;
                    return status;
                }
                else
                {
                    printf("Failed while appending : %d\n", status);
                    f_close (&fp);
                    attempts_remain--;
                    write_sd_card (file_no);
                }
            }
            else
            {
                printf("File write failed : %d\n", status);
                f_close (&fp);
                attempts_remain--;
                write_sd_card (file_no);
            }
        }
        else
        {
            printf("File open failed : %d\n",status);
            f_close (&fp); 
            attempts_remain--;
            write_sd_card (file_no);
        }
    }
    else 
    {
        printf("All attempts failed\n");
        g_file_no--;
        attempts_remain = FILE_OPER_MAX_TRY;
    }

}

uint32_t file_name_to_no (uint8_t * f_name)
{
    uint32_t file_no = 0;
    file_no = ((f_name[0] > 0x29) && (f_name[0] < 0x3A)) ?
        (((f_name[0] - 0x30) * 1000) + 
        ((f_name[1] - 0x30) * 100) +
        ((f_name[2] - 0x30) * 10) +
        ((f_name[3] - 0x30) * 1)) :
        g_file_no;
    return (file_no < g_file_no) ? g_file_no : file_no;
}

void get_file_no ()
{
    printf("%s\n", __func__);
    uint32_t status;
    uint32_t no_bytes;
    uint8_t file_buff[4];
    FILINFO file_info;
    DIR dp;
    status = f_opendir (&dp, "/");
    if(status == FR_OK)
    {
        do
        {
            status = f_readdir (&dp, &file_info);
            if(status == FR_OK)
            {
                
                g_file_no = file_name_to_no ((uint8_t *)file_info.fname); 
                
                printf("%s\n",file_info.fname);
            }else{printf("Read dir failed : %d\n",status);}
            
        }while(file_info.fname[0] != '\0');
        printf("File Number : %d\n", g_file_no);
        status = f_closedir (&dp);
        if(status == FR_OK)
        {
            printf("DIR Close\n");
        }else{printf("Close DIR failed : 0x%x\n", status);}
    }else{printf("DIR open failed : 0x%x\n", status);}
}

void cam_init (uint32_t not_used)
{
    printf("%s\n", __func__);
//    uint16_t rows;
//    uint32_t row_time = ROW_TIME;
//    rows = (g_expo_us/row_time); // line_length(1388)/PCLK(50MHz)
//    CAMERA_IO_Write (CameraHwAddress, COARSE_INTEGRATION_TIME, rows);

}

void cam_shot_start (uint32_t not_used)
{
    printf("%s\n", __func__);
    static GPIO_InitTypeDef GPIO_InitStruct = {0};
    /*Configure GPIO pin : PtPin */
    __disable_irq() ;

    __HAL_GPIO_EXTI_CLEAR_IT(USER_BUTTON_Pin | ARDUINO_A3_Pin);
    
    HAL_GPIO_DeInit(ARDUINO_A3_GPIO_Port, ARDUINO_A3_Pin);
    HAL_GPIO_DeInit(USER_BUTTON_GPIO_Port, USER_BUTTON_Pin);
    HAL_GPIO_DeInit(ARDUINO_A1_GPIO_Port, ARDUINO_A1_Pin);

    GPIO_InitStruct.Pin = USER_BUTTON_Pin;  // User Button
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLDOWN; // With button
    HAL_GPIO_Init(USER_BUTTON_GPIO_Port, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = ARDUINO_A3_Pin;  // SenseDev
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP; // With SenseDev
    HAL_GPIO_Init(ARDUINO_A3_GPIO_Port, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = ARDUINO_A1_Pin;  // Flash
    GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    HAL_GPIO_Init(ARDUINO_A1_GPIO_Port, &GPIO_InitStruct);

    
    
    __enable_irq() ;
    htim1.Instance->CCR1 = htim1.Instance->CNT + SHOT_TICKS;
//    HAL_TIM_OC_Start_IT (&htim1, TIM_CHANNEL_1);
//    HAL_GPIO_WritePin (ARDUINO_D4_GPIO_Port, ARDUINO_D4_Pin, 1);
    __HAL_DCMI_CLEAR_FLAG(&hdcmi, DCMI_FLAG_VSYNC);
    __HAL_DCMI_ENABLE_IT(&hdcmi, DCMI_IT_VSYNC);
    HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, (uint32_t)_fb_base_hr, Im_size);
//    HAL_GPIO_WritePin (ARDUINO_A2_GPIO_Port, ARDUINO_A2_Pin, 1);

